pawelc06/STM32F4_Nec_Remote_Test/ILI_TEST1/ILI_TEST1/src/Lcd_Driver.c
	/*
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO|RCC_APB2Periph_GPIOB, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;  //PB7-MISO
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
	GPIO_Init(GPIOB, &GPIO_InitStructure);  

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;  //PB6-MOSI
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11| GPIO_Pin_12| GPIO_Pin_10 | GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	*/

}




//spi Đ´Ň»¸ö×Ö˝Ú
u8 SPI_WriteByte(SPI_TypeDef* SPIx,u8 Byte)
{
	while((SPIx->SR&SPI_I2S_FLAG_TXE)==RESET);		//µČ´ý·˘ËÍÇřżŐ
	SPIx->DR=Byte;	 	//·˘ËÍŇ»¸öbyte
	while((SPIx->SR&SPI_I2S_FLAG_RXNE)==RESET);//µČ´ý˝ÓĘŐÍęŇ»¸öbyte
	return SPIx->DR;          	     //·µ»ŘĘŐµ˝µÄĘýľÝ
} 

//ÉčÖĂSPIµÄËŮ¶Č
//SpeedSet:1,¸ßËŮ;0,µÍËŮ;
void SPI_SetSpeed(SPI_TypeDef* SPIx,u8 SpeedSet)
{
	SPIx->CR1&=0XFFC7;
	if(SpeedSet==1)//¸ßËŮ
	{
		SPIx->CR1|=SPI_BaudRatePrescaler_8;//Fsck=Fpclk/2	
	}
	else//µÍËŮ
	{
		SPIx->CR1|=SPI_BaudRatePrescaler_32; //Fsck=Fpclk/32
	}
	SPIx->CR1|=1<<6; //SPIÉč±¸ĘąÄÜ
} 

void SPI2_Init(void)	
{

	SPI_InitTypeDef  SPI_InitStructure;

	GPIO_InitTypeDef GPIO_InitStructure;
	RCC->AHBENR |= RCC_AHBENR_GPIOBEN;
	    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;

	    // GPIOB - SCK, MISO, MOSI
		GPIOB->MODER |= GPIO_MODER_MODER13_1 | GPIO_MODER_MODER14_1 | GPIO_MODER_MODER15_1;
		GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR13 | GPIO_OSPEEDER_OSPEEDR14 | GPIO_OSPEEDER_OSPEEDR15;
		GPIOB->AFR[1] = 0x55500000;

		// GPIOB - PB12( CS )
		GPIOB->MODER |= GPIO_MODER_MODER12_0;
		GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12;

		// init spi2
		RCC->APB1RSTR |= RCC_APB1RSTR_SPI2RST;
	    delay_ms( 15 );
	    RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
	 
		/*
	    SPI2->CR1 |= SPI_CR1_MSTR | SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_CPHA | SPI_CR1_CPOL | SPI_CR1_BR_0;
	    SPI2->CR1 |= SPI_CR1_SPE;
	    */

	    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	    	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	    	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	    	SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
	    	SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
	    	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	    	//SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4; //8MHz
	    	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2; // 16MHz
	    	//SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16; //500 kHz
	    	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	    	SPI_InitStructure.SPI_CRCPolynomial = 7;
	    	SPI_Init(SPI2, &SPI_InitStructure);


	    	SPI_Cmd(SPI2, ENABLE);

	//uint16_t afr = GPIOB->AFR[1];
	//uint16_t cr1 = SPI2->CR1;

}

/****************************************************************************
* Ăű    łĆŁşvoid ili9220B_WriteIndex(u16 idx)
* ą¦    ÄÜŁşĐ´ ili9220B żŘÖĆĆ÷ĽÄ´ćĆ÷µŘÖ·
* ČëżÚ˛ÎĘýŁşidx   ĽÄ´ćĆ÷µŘÖ·
* łöżÚ˛ÎĘýŁşÎŢ
* Ëµ    Ă÷Łşµ÷ÓĂÇ°ĐčĎČŃˇÖĐżŘÖĆĆ÷Ł¬ÄÚ˛żşŻĘý
****************************************************************************/
void Lcd_WriteIndex(u8 Index)
{
   u8 i=0;
   //SPI Đ´ĂüÁîĘ±ĐňżŞĘĽ
   LCD_CS_CLR;
   LCD_RS_CLR;
   for (i = 0; i < 5; i++) { /* Wait a bit. */
   			__asm__("NOP");
   		}

   //SPIv_WriteByte(Index);
   SPI_WriteByte(SPI2,Index);
   
   LCD_CS_SET;
}

/****************************************************************************
* Ăű    łĆŁşvoid ili9220B_WriteData(u16 dat)
* ą¦    ÄÜŁşĐ´ ili9220B ĽÄ´ćĆ÷ĘýľÝ
* ČëżÚ˛ÎĘýŁşdat     ĽÄ´ćĆ÷ĘýľÝ
* łöżÚ˛ÎĘýŁşÎŢ
* Ëµ    Ă÷ŁşĎňżŘÖĆĆ÷Ö¸¶¨µŘÖ·Đ´ČëĘýľÝŁ¬µ÷ÓĂÇ°ĐčĎČĐ´ĽÄ´ćĆ÷µŘÖ·Ł¬ÄÚ˛żşŻĘý
****************************************************************************/
void Lcd_WriteData(u8 Data)
{
   u8 i=0;

   LCD_RS_SET;
   LCD_CS_CLR;

   /*
   for ( i = 0; i < 5; i++) {
   			__asm__("NOP");
   		}
*/

   //SPIv_WriteByte(Data);
   SPI_WriteByte(SPI2,Data);

   /* Wait for transfer finished. */
   		//while (!(SPI2->SR & SPI_SR_RXNE));
   //while ((SPI2->SR & SPI_SR_TXE));


   LCD_CS_SET;
}

void Lcd_WriteData16Bit(u8 DataH,u8 DataL)
{
	Lcd_WriteData(DataH);
	Lcd_WriteData(DataL);
}

void Lcd_WriteIndex16Bit(u8 DataH,u8 DataL)
{
	Lcd_WriteIndex(DataH);
	Lcd_WriteIndex(DataL);
}



void Lcd_Reset(void)
{
	LCD_RST_CLR;
	delay_ms(10);
	LCD_RST_SET;
	delay_ms(50);
}


void Lcd_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	char TFTDriver=0;
	int i=0;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
	//LCD_RST_CLR
	/*!< Configure SD_SPI_CS_PIN pin: SD Card CS pin */
		  GPIO_InitStructure.GPIO_Pin = LCD_RST;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  	  	  GPIO_InitStructure.GPIO_Pin = LCD_CS;
		  		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  		GPIO_InitStructure.GPIO_Pin = LCD_RS;
		  				  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  				  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  				  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  				  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  				  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  LCD_RST_SET;
		  LCD_CS_SET;
		  LCD_RS_SET;


	//SPIv_Init();
	SPI2_Init();
	Lcd_Reset();
	
	for(i=0;i<3;i++)
	    {
			//printf("Pętla: %d\r\n",i);
	        TFTDriver = readID();
	    }

	Lcd_WriteIndex(0xCB);  
        Lcd_WriteData(0x39); 
        Lcd_WriteData(0x2C); 
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0x34); 
        Lcd_WriteData(0x02); 

