pawelc06/STM32F4_Nec_Remote_Test/ILI_TEST1/ILI_TEST1/src/Lcd_Driver.c
}

void Lcd_Init2(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	char TFTDriver=0;
	int i=0;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
	//LCD_RST_CLR
	/*!< Configure SD_SPI_CS_PIN pin: SD Card CS pin */
		  GPIO_InitStructure.GPIO_Pin = LCD_RST;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  	  	  GPIO_InitStructure.GPIO_Pin = LCD_CS;
		  		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  		GPIO_InitStructure.GPIO_Pin = LCD_RS;
		  				  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  				  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  				  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  				  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  				  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  LCD_RST_SET;
		  LCD_CS_SET;
		  LCD_RS_SET;


	//SPIv_Init();
	SPI2_Init();
	Lcd_Reset();

	for(i=0;i<3;i++)
	    {
			//printf("Pętla: %d\r\n",i);
	        TFTDriver = readID();
	    }

	Lcd_WriteIndex(0xEF);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x80);
	  Lcd_WriteData(0x02);

	  Lcd_WriteIndex(0xCF);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0XC1);
	  Lcd_WriteData(0X30);

	  Lcd_WriteIndex(0xED);
	  Lcd_WriteData(0x64);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0X12);
	  Lcd_WriteData(0X81);

	  Lcd_WriteIndex(0xE8);
	  Lcd_WriteData(0x85);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x78);

	  Lcd_WriteIndex(0xCB);
	  Lcd_WriteData(0x39);
	  Lcd_WriteData(0x2C);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x34);
	  Lcd_WriteData(0x02);

	  Lcd_WriteIndex(0xF7);
	  Lcd_WriteData(0x20);

	  Lcd_WriteIndex(0xEA);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_PWCTR1); //Power control
	  Lcd_WriteData(0x23); //VRH[5:0]

	  Lcd_WriteIndex(ILI9341_PWCTR2); //Power control
	  Lcd_WriteData(0x10); //SAP[2:0];BT[3:0]

	  Lcd_WriteIndex(ILI9341_VMCTR1); //VCM control
	  Lcd_WriteData(0x3e); //¶Ô±È¶Èµ÷½Ú
	  Lcd_WriteData(0x28);

	  Lcd_WriteIndex(ILI9341_VMCTR2); //VCM control2
	  Lcd_WriteData(0x86); //--

	  Lcd_WriteIndex(ILI9341_MADCTL); // Memory Access Control
	  //Lcd_WriteData(0x48);
	  Lcd_WriteData(MADCTL_MX | MADCTL_MY | MADCTL_MV | MADCTL_BGR);

	  Lcd_WriteIndex(ILI9341_PIXFMT);
	  Lcd_WriteData(0x55);



	  Lcd_WriteIndex(ILI9341_FRMCTR1);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x18);

	  Lcd_WriteIndex(ILI9341_DFUNCTR); // Display Function Control
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x82);
	  Lcd_WriteData(0x27);






	  Lcd_WriteIndex(0xF2); // 3Gamma Function Disable
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_GAMMASET); //Gamma curve selected
	  Lcd_WriteData(0x01);

	  Lcd_WriteIndex(ILI9341_GMCTRP1); //Set Gamma
	  Lcd_WriteData(0x0F);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0x2B);
	  Lcd_WriteData(0x0C);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x4E);
	  Lcd_WriteData(0xF1);
	  Lcd_WriteData(0x37);
	  Lcd_WriteData(0x07);
	  Lcd_WriteData(0x10);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x09);
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_GMCTRN1); //Set Gamma
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x14);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x11);
	  Lcd_WriteData(0x07);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0xC1);
	  Lcd_WriteData(0x48);
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x0F);
	  Lcd_WriteData(0x0C);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0x36);
	  Lcd_WriteData(0x0F);

	  Lcd_WriteIndex(ILI9341_SLPOUT); //Exit Sleep
	  delay_ms(120);
	  Lcd_WriteIndex(ILI9341_DISPON); //Display on


}


/*************************************************
şŻĘýĂűŁşLCD_Set_Region
ą¦ÄÜŁşÉčÖĂlcdĎÔĘľÇřÓňŁ¬ÔÚ´ËÇřÓňĐ´µăĘýľÝ×Ô¶Ż»»ĐĐ
ČëżÚ˛ÎĘýŁşxyĆđµăşÍÖŐµă,Y_IncMode±íĘľĎČ×ÔÔöyÔŮ×ÔÔöx
·µ»ŘÖµŁşÎŢ
*************************************************/
void Lcd_SetRegion(u16 x_start,u16 y_start,u16 x_end,u16 y_end)
{	
	Lcd_WriteIndex(0x2a); //column address set
	Lcd_WriteData16Bit(x_start>>8,x_start);
	Lcd_WriteIndex(0x2b); // page address set
	Lcd_WriteData16Bit(y_start>>8,y_start);
	Lcd_WriteIndex(0x2c); //memory write
	/*	
	Lcd_WriteIndex(0x50);
	Lcd_WriteData16Bit(x_start>>8,x_start);
	Lcd_WriteIndex(0x51);
	Lcd_WriteData16Bit(x_end>>8,x_end);

	Lcd_WriteIndex(0x52);
	Lcd_WriteData16Bit(y_start>>8,y_start);
	Lcd_WriteIndex(0x53);
	Lcd_WriteData16Bit(y_end>>8,y_end);


	Lcd_WriteIndex(0x22); */

}

void setAddrWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {

	Lcd_WriteIndex(ILI9341_CASET); // Column addr set
	Lcd_WriteData(x0 >> 8);
	Lcd_WriteData(x0 & 0xFF); // XSTART
	Lcd_WriteData(x1 >> 8);
	Lcd_WriteData(x1 & 0xFF); // XEND

  Lcd_WriteIndex(ILI9341_PASET); // Row addr set
  Lcd_WriteData(y0>>8);
  Lcd_WriteData(y0); // YSTART
  Lcd_WriteData(y1>>8);
  Lcd_WriteData(y1); // YEND

  Lcd_WriteIndex(ILI9341_RAMWR); // write to RAM
}

/*************************************************
şŻĘýĂűŁşLCD_Set_XY
ą¦ÄÜŁşÉčÖĂlcdĎÔĘľĆđĘĽµă
ČëżÚ˛ÎĘýŁşxy×ř±ę
·µ»ŘÖµŁşÎŢ
*************************************************/
void Lcd_SetXY(u16 x,u16 y)
{
  	Lcd_WriteIndex(0x2a);
	Lcd_WriteData16Bit(x>>8,x);
	Lcd_WriteIndex(0x2b);
	Lcd_WriteData16Bit(y>>8,y);

	Lcd_WriteIndex(0x2c);
}

	
/*************************************************
şŻĘýĂűŁşLCD_DrawPoint
ą¦ÄÜŁş»­Ň»¸öµă
ČëżÚ˛ÎĘýŁşÎŢ
·µ»ŘÖµŁşÎŢ
*************************************************/
void Gui_DrawPoint(u16 x,u16 y,u16 Data)
{
	Lcd_SetRegion(x,y,x,y);
	Lcd_WriteData(Data>>8);
	Lcd_WriteData(Data);

