pawelc06/STM32F4_Nec_Remote_Test/ILI_TEST1/ILI_TEST1/src/Lcd_Driver.c
}    

/*****************************************
 şŻĘýą¦ÄÜŁş¶ÁTFTÄłŇ»µăµÄŃŐÉ«
 łöżÚ˛ÎĘýŁşcolor  µăŃŐÉ«Öµ
******************************************/
unsigned int Lcd_ReadPoint(u16 x,u16 y)
{
  unsigned int Data=0;
  Lcd_SetXY(x,y);

  //Lcd_ReadData();//¶ŞµôÎŢÓĂ×Ö˝Ú
  //Data=Lcd_ReadData();
  Lcd_WriteData(Data);
  return Data;
}
/*************************************************
şŻĘýĂűŁşLcd_Clear
ą¦ÄÜŁşČ«ĆÁÇĺĆÁşŻĘý
ČëżÚ˛ÎĘýŁşĚîłäŃŐÉ«COLOR
·µ»ŘÖµŁşÎŢ
*************************************************/
void Lcd_Clear(u16 Color)               
{	
   unsigned int i,m;
   Lcd_SetRegion(0,0,X_MAX_PIXEL-1+200,Y_MAX_PIXEL-1+200);
   LCD_CS_CLR;
   //LCD_RS_SET;
   LCD_RS_SET;
   //SPIv_WriteByte(Data);

   
   for(i=0;i<Y_MAX_PIXEL+200;i++)
   {
    for(m=0;m<X_MAX_PIXEL+200;m++)
      {	 
	  	//SPIv_WriteByte(Color>>8);  
		//SPIv_WriteByte(Color);
		SPI_WriteByte(SPI2,Color>>8);
		SPI_WriteByte(SPI2,Color);
	  	//Lcd_WriteData16Bit(Color>>8,Color);
		//Lcd_WriteData(Color>>8);
		//Lcd_WriteData(Color);
      }   
	}
	 LCD_CS_SET;
}

void fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {

		  // rudimentary clipping (drawChar w/big text requires this)
		  if((x >= X_MAX_PIXEL) || (y >= Y_MAX_PIXEL)) return;
		  if((x + w - 1) >= X_MAX_PIXEL) w = X_MAX_PIXEL - x;
		  if((y + h - 1) >= Y_MAX_PIXEL) h = Y_MAX_PIXEL - y;

		  setAddrWindow(x, y, x+w-1, y+h-1);

		  uint8_t hi = color >> 8, lo = color;

		  //*dcport |= dcpinmask;
		  //digitalWrite(_dc, HIGH);
		  //*csport &= ~cspinmask;
		  //digitalWrite(_cs, LOW);

		  LCD_CS_CLR;
		  LCD_RS_SET;

		  for(y=h; y>0; y--) {
		    for(x=w; x>0; x--) {
		    	SPI_WriteByte(SPI2,hi);
		    	SPI_WriteByte(SPI2,lo);
		    }
		  }
		  //digitalWrite(_cs, HIGH);
		  //*csport |= cspinmask;
		  LCD_CS_SET;
		}

void Lcd_Clear2(u16 Color)
{
	fillRect(0, 0,  X_MAX_PIXEL, Y_MAX_PIXEL, Color);
}

char readID(void)
{
    char i=0;
    uint8_t data[3] ;
    uint8_t ID[3] = {0x00, 0x93, 0x41};
    char ToF=1;
    for(i=0;i<3;i++)
    {
		//rintf("Read reg 1\r\n");
        data[i]=Read_Register(0xd3,i+1);
        if(data[i] != ID[i])
        {
            ToF=0;
        }
        //printf("Read reg 2\r\n");
    }
    if(!ToF) /* data!=ID */
    {
        //printf("\n\rRead TFT ID failed, ID should be 0x09341, but read ID = 0x");
        for(i=0;i<3;i++)
        {
            //printf("Dane : %d - %d " , i , data[i] );
        }
        //Serial.println();
    } else
		//printf("TFT Found\n\r");
    	;
    return ToF;
}

char Read_Register(char Addr, char xParameter)
{
    char data=0;
    uint8_t tt = 0;
    int i;
    //sendCMD(0xd9); /* ext command */
    Lcd_WriteIndex(0xd9);

    //WRITE_DATA(0x10+xParameter); /* 0x11 is the first Parameter */
    Lcd_WriteData(0x10+xParameter);

    //TFT_DC_LOW;
    LCD_RS_CLR;

    //TFT_CS_LOW;
    LCD_CS_CLR;

    for (i = 0; i < 5; i++) { /* Wait a bit. */
			__asm__("NOP");
		}
    //tt = spi_xfer(SPI2, Addr)

    tt = SPI_WriteByte(SPI2, Addr);

		//while (!(SPI_SR(SPI2) & SPI_SR_RXNE));
    //TFT_DC_HIGH;
		LCD_RS_SET;

    for ( i = 0; i < 2; i++) { /* Wait a bit. */
			__asm__("NOP");
		}
    //tt =  SPI_DR(SPI2);
    tt = SPI2->DR;

    tt = spi_readwrite(SPI2, 0);
    //tt = SPI_WriteByte(SPI2, 0);

    //TFT_CS_HIGH;
    LCD_CS_SET;

    return tt;
}

static uint8_t spi_readwrite(uint32_t spi, uint8_t data)
{
	//while (SPI_SR(spi) & SPI_SR_BSY);
	while (SPI2->SR & SPI_SR_BSY);

	//SPI_DR(spi) = data;
	SPI2->DR = data;

	while (!(SPI2->SR & SPI_SR_RXNE));
	return SPI2->DR;
}

/**
* Konwersja Int na String
* x = input integer, s = output buffer
*/
void itoa(uint16_t n, int8_t s[]){
	int i, sign;
	if ((sign = n) < 0) /* record sign */
	n = -n; /* make n positive */
	i = 0;
	do { /* generate digits in reverse order */
		s[i++] = n % 10 + '0'; /* get next digit */
	} while ((n /= 10) > 0); /* delete it */
	if (sign < 0)
	s[i++] = '-';

	if(i<2)
		s[i] = '0';
	reverse(s);
}

/**
* odwrócenie stringów
* s = string
*/
void reverse(int8_t s[])
{
int i, j;
char c;

for (i = 0, j = strlen(s)-1; i<j; i++, j--) {
		 c = s[i];
s[i] = s[j];
s[j] = c;
}
}

void LCD_Write_Colon(u16 xpos,u16 ypos){
	u16 short_break = 30;

	//colon
	//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,11);
	tft_puts(xpos,ypos, ":", red, white);

	xpos = xpos+short_break;
}

void LCD_Write_Date(u16 xpos,u16 ypos,RTC_DateTypeDef  * RTC_DateStruct)
{
	uint8_t year, month, day, weekday;
	const u16 short_break = 10;
	char yearStr[5];
	char mStr[5];
	char dStr[5];

	uint8_t datas[9];



	year = RTC_DateStruct->RTC_Year;
	month = RTC_DateStruct->RTC_Month;
	day = RTC_DateStruct->RTC_Date;
	weekday = RTC_DateStruct->RTC_WeekDay;

	//sprintf(yearStr,"%02d",year);
	itoa(year+2000,yearStr);
	itoa(month,mStr);
	itoa(day,dStr);



	setCurrentFont( &Verdana26ptFontInfo);

					tft_puts(xpos,ypos, "2014-07-08", white, black);
					tft_puts(xpos,ypos+40, "wtorek", white, black);
					//tft_puts(xpos,ypos+80, "ALARM1", white, black);


	/*
	Gui_DrawFont_GBK24(xpos,ypos, BLUE, GRAY0, yearStr);
	xpos = xpos+4*short_break;

	Gui_DrawFont_GBK24(xpos,ypos, BLUE, GRAY0, "-");

	xpos = xpos+short_break;

	Gui_DrawFont_GBK24(xpos,ypos, BLUE, GRAY0, mStr);

	xpos = xpos+2*short_break;

	Gui_DrawFont_GBK24(xpos,ypos, BLUE, GRAY0, "-");

	xpos = xpos+short_break;

	Gui_DrawFont_GBK24(xpos,ypos, BLUE, GRAY0, dStr);
	*/

}

void LCD_Write_TimeBCD2(u16 xpos,u16 ypos,RTC_TimeTypeDef * RTC_TimeStructure1)
{

	unsigned char datas[6];
	unsigned char datah[3];
	unsigned char datam[3];

	unsigned colon[2];

	uint8_t short_break=47;

	u16 hh=14;
	u16 mm=33;
	u16 ss=55;


	hh = RTC_TimeStructure1->RTC_Hours;
	mm = RTC_TimeStructure1->RTC_Minutes;
	ss = RTC_TimeStructure1->RTC_Seconds;

	//hours

